[
{"todo": "Preparing for the Interview", "todo-answer": ["Research the position and organization (e.g., mission, goals, etc.) prior to the interview. Familiarize yourself with the duties, responsibilities and requirements of the position. Don’t assume you know everything about the organization even if you have experience with the organization. Always do your research.", "Review your application and resume, and be prepared to support past accomplishments with specific information targeted towards the position requirements. Be sure that you focus on your paid and non-paid experience. Don’t assume the interviewer knows everything about you.", "Practice interviewing. Take the time to research and review typical interview questions to help give you a framework for your responses.", "Be flexible with scheduling and allow sufficient time for the interview. Be sure to ask for specifics regarding the time, location, point of contact (POC) as well as any other logistical details.", "Ask whether there will be one or multiple interviewers."]},
{"todo": "During the Interview", "todo-answer": ["Plan to arrive early. Keep in mind that security/access requirements and time to get on the site may vary by location. Check with the POC regarding appropriate arrival times, check-in procedures, and logistics. Remember you get one chance to make a first impression.", "Be prepared to summarize your experience in about 30 seconds and describe what you bring to the position.", "Listen carefully to each question asked. Answer questions as directly as possible. Focus on your achievements relevant to the position using examples of how your knowledge, skills and abilities fit the job. Be sure to ask the interviewer to restate a question if further clarification is needed.", "Remain positive and avoid negative comments about past employers.", "Be aware of your body language and tone of voice. Remain engaged by giving your full attention to the interviewer.", "Take limited notes, if desired.", "Be sure to ask any final questions about the organization or the position. Also, ask about the next steps in the selection process to include timeframes. Request POC information should you have any follow up questions.", "Reinforce your interest in the position and thank the interviewer(s) for the opportunity to interview."]},
{"todo": "After the Interview", "todo-answer": ["Provide any additional requested information as soon as possible.", "Be patient. Remember the hiring process takes time. You can follow up with your POC if you have not been contacted within the established timeframe."]}
]